Description: 'Downloads latest Zoom app and uploads to Fleet'
Identifier: com.github.kitzy.fleet.Zoom
Input:
  NAME: Zoom
MinimumVersion: '2.0'
ParentRecipe: com.github.homebysix.pkg.Zoom
Process:
- Arguments:
    pkg_path: '%pkg_path%'
    software_title: '%NAME%'
    version: '%version%'
    
    fleet_api_base: '%FLEET_API_BASE%'
    fleet_api_token: '%FLEET_API_TOKEN%'
    team_id: '%FLEET_TEAM_ID%'
    self_service: true
  Processor: com.github.kitzy.FleetImporter/FleetImporter