Description: 'Downloads latest 1Password 8 desktop app and uploads to Fleet'
Identifier: com.github.kitzy.fleet.1Password8
Input:
  NAME: 1Password
MinimumVersion: '2.0'
ParentRecipe: io.github.hjuutilainen.pkg.1Password8
Process:
- Arguments:
    pkg_path: '%pkg_path%'
    software_title: '%NAME%'
    version: '%version%'
    fleet_api_base: '%FLEET_API_BASE%'
    fleet_api_token: '%FLEET_API_TOKEN%'
    team_id: '%FLEET_TEAM_ID%'
    self_service: true
  Processor: com.github.kitzy.FleetImporter/FleetImporter