Description: "Builds iTerm2.pkg using the upstream recipe, then uploads to Fleet."
Identifier: com.github.fleet.direct.iTerm2
Input:
  NAME: iTerm2
  SELF_SERVICE: true
  CATEGORIES:
  - Developer tools
MinimumVersion: "2.3"
ParentRecipe: io.github.hjuutilainen.pkg.iTerm2
Process:
- Arguments:
    pkg_path: "%pkg_path%"
    software_title: "%NAME%"
    version: "%version%"
    fleet_api_base: "%FLEET_API_BASE%"
    fleet_api_token: "%FLEET_API_TOKEN%"
    team_id: "%FLEET_TEAM_ID%"
    self_service: "%SELF_SERVICE%"
    categories: "%CATEGORIES%"
  Processor: com.github.fleet.FleetImporter/FleetImporter
